# Pandas Week 8

# 29. Random Sampling pada Pandas Data Frame

In [3]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [4]:
#Data Frame Prep
d = {'col_1':[1,2,3,4,5],
    'col_2':[6,7,8,9,10]}
df= pd.DataFrame(d)
df

   col_1  col_2
0      1      6
1      2      7
2      3      8
3      4      9
4      5     10

# Random sampling with/without replacement

- Random Sampling with (replace =True) replacement berarti data-data yang sudah disampling di population memiliki kesempatan untuk kita sampling lagi 

- Random Sampling without replacement (replace =False) berarti data-data yang sudah disampling di population tidak akan kita sampling lagi

In [5]:
df.sample(n=4, replace=False, random_state=0)

   col_1  col_2
2      3      8
0      1      6
1      2      7
3      4      9

In [6]:
df.sample(n=4, replace=True, random_state=0)

   col_1  col_2
4      5     10
0      1      6
3      4      9
3      4      9

note:
- parameter n adalah jumlah data 
- paramter random_state bisa ditentukan dengan nilai integer berapanpun. Fungsi utama dari paramter ini adalah untuk menjamin agar suatu eksperimen dapat direplikasi atau dapat dilakukan ulang dengan hasil yang sama persis

# 30. Akses nilai variabel dalam fungsi query

In [16]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [17]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

qf = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
qf

    A   B   C   D   E
0   1   9   8  16  10
1  13   6  15  12  15
2   8   2  18  12   7
3  18   9   8  18   3
4  18  10  12  14   5

# Akses nilai varialbe pada query()

method  query() ini digunakan untuk melakukan seleksi baris

In [18]:
qf.query('A > 5')

    A   B   C   D   E
1  13   6  15  12  15
2   8   2  18  12   7
3  18   9   8  18   3
4  18  10  12  14   5

method query diatas digunakan untuk menyeleksi baris-baris yang nilai pada kolom Anya lebih besar dari 5

In [19]:
rerata = qf['A'].mean()
rerata

11.6

variable rerata diatas digunakan untuk menampung nilai mean dari kolom A

In [20]:
qf.query('A > @rerata')

    A   B   C   D   E
1  13   6  15  12  15
3  18   9   8  18   3
4  18  10  12  14   5

method query diatas akan menampilkan baris-baris yang nilai kolom A nya diatas rata-ratanya